{
  "backend/main.mo": "Actor managing blob storage, user profiles with access control, and CRUD-style product storage and queries by category.",
  "feature_evidence.json": "Lists implemented features, affected files, components, and test IDs for recent site updates like About Us and Home page sections.",
  "frontend-file-summaries.txt": "Contains short descriptions of multiple frontend files including hooks, pages, components, and utilities.",
  "frontend/index.css": "Tailwind CSS setup defining theme variables and light/dark mode base styles.",
  "frontend/index.html": "Base HTML file bootstrapping the frontend app and mounting the root React element.",
  "frontend/src/App.tsx": "Configures routes, global providers, theming, and main layout for the React application.",
  "frontend/src/components/admin/AdminRouteGuard.tsx": "Protects admin routes by validating admin session state and handling connectivity issues before rendering children.",
  "frontend/src/components/admin/ImagePicker.tsx": "Image upload component that validates, compresses, previews, and outputs ExternalBlob values for product images.",
  "frontend/src/components/admin/ProductEditorDialog.tsx": "Dialog component for creating or editing products, managing form state, validation, and mutation calls.",
  "frontend/src/components/admin/ProductTable.tsx": "Displays products in a table with edit and delete actions, plus dialogs for editing and confirming deletion.",
  "frontend/src/components/branding/BrandingHero.tsx": "Hero section showing DailyKart branding, tagline, feature badges, and a hero image.",
  "frontend/src/components/branding/HomeRksContactBlock.tsx": "Static contact block showing brand name, address, and phone number.",
  "frontend/src/components/cart/CartProvider.tsx": "Context provider exposing cart state and actions via useCart and supplying them to children.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer displaying branding, tagline, and attribution link.",
  "frontend/src/components/layout/SiteHeader.tsx": "Header with navigation, cart badge, mobile menu handling, and admin link.",
  "frontend/src/components/layout/SiteLayout.tsx": "Layout wrapper combining header, footer, and page content.",
  "frontend/src/components/products/CategorySection.tsx": "Renders a titled product section with a grid or empty message.",
  "frontend/src/components/products/CategorySwitcher.tsx": "Tabs component for switching between all, food, and grocery product categories.",
  "frontend/src/components/products/ProductCard.tsx": "Card displaying product details with add-to-cart and WhatsApp order actions.",
  "frontend/src/components/products/ProductGrid.tsx": "Responsive grid layout rendering product cards for a list of products.",
  "frontend/src/hooks/admin/useAdminSession.ts": "Manages admin session state using React Query, handling token storage, validation, and login mutations with error handling.",
  "frontend/src/hooks/cart/useCart.ts": "Provides cart state with sessionStorage persistence and actions to modify items, quantities, and compute totals.",
  "frontend/src/hooks/products/useProductMutations.ts": "Defines create, update, and delete product mutations requiring admin authentication and invalidating product queries.",
  "frontend/src/hooks/products/useProducts.ts": "Fetches all product summaries via the actor with retry logic and loading state integration.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on Internet Identity and refreshes dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, handling login, logout, identity loading, and exposing status flags.",
  "frontend/src/index.css": "Tailwind setup with custom CSS variables defining light and dark theme color palettes.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and Internet Identity providers and renders the root component.",
  "frontend/src/pages/AboutPage.tsx": "Static About page describing DailyKart, its service area, and various policies.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin view for managing products with add dialog, product table, and logout handling.",
  "frontend/src/pages/admin/AdminLoginPage.tsx": "Admin login form with validation, error normalization, and redirects on success.",
  "frontend/src/pages/CartPage.tsx": "Displays cart items with quantity controls, removal, subtotal, and navigation to checkout, handling empty-cart state.",
  "frontend/src/pages/CheckoutPage.tsx": "Handles customer details form, validates input, builds WhatsApp order link, and clears cart after submission.",
  "frontend/src/pages/CustomerPanelPage.tsx": "Shows menu with category filter, product loading states, and contact block for customers.",
  "frontend/src/pages/ProductListingPage.tsx": "Lists all products grouped by category with loading and error handling.",
  "frontend/src/types/cart.ts": "Defines cart item, state, and action interfaces for managing cart operations.",
  "frontend/src/utils/adminAuthErrors.ts": "Normalizes admin authentication errors by extracting raw messages and categorizing them into invalid credentials, connectivity issues, or system errors.",
  "frontend/src/utils/images.ts": "Validates image uploads for type and size and provides a function to compress images via canvas before upload.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, persisting, and clearing URL parameters with sessionStorage support, including hash‑based routing handling.",
  "frontend/src/utils/whatsapp.ts": "Builds WhatsApp order URLs for single products or full cart orders, formatting customer details and item lists.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, typography, animations, and plugin setup.",
  "project_state.json": "Stores project metadata, features, issues, branding changes, and architectural notes for the DailyKart app."
}