{
  "backend/main.mo": "Backend canister implementing blob storage, access control, user profiles, and product CRUD with categories and image blobs.",
  "feature_evidence.json": "Feature evidence report mapping two admin dashboard UI improvements to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Plain text list of frontend file paths with short summaries describing their functionality.",
  "frontend/index.css": "Tailwind CSS setup defining light and dark theme CSS variables and global styles.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app configuring routing, providers, layout, and admin-protected routes.",
  "frontend/src/components/admin/AdminRouteGuard.tsx": "Route guard that checks admin authentication, handles connectivity issues, and redirects when appropriate.",
  "frontend/src/components/admin/ImagePicker.tsx": "Image picker component that validates, compresses, previews, and outputs ExternalBlob images.",
  "frontend/src/components/admin/ProductEditorDialog.tsx": "Dialog component for creating or editing products with form fields, image picker, and mutation handlers.",
  "frontend/src/components/admin/ProductTable.tsx": "Displays products in a table with edit/delete actions and uses dialogs for editing and confirming deletion.",
  "frontend/src/components/branding/BrandingHero.tsx": "Hero section showing brand visuals, tagline, and feature badges with responsive layout.",
  "frontend/src/components/cart/CartProvider.tsx": "Context provider exposing cart state and actions using the custom useCart hook.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer with branding text and attribution link displayed responsively.",
  "frontend/src/components/layout/SiteHeader.tsx": "Header with navigation, cart badge, mobile menu, and admin link using cart context and router navigation.",
  "frontend/src/components/layout/SiteLayout.tsx": "Page layout wrapper that includes header, footer, and main content area.",
  "frontend/src/components/products/CategorySection.tsx": "Renders a titled section showing a product grid or an empty message.",
  "frontend/src/components/products/CategorySwitcher.tsx": "Tabs UI for switching between all, food, and grocery product categories.",
  "frontend/src/components/products/ProductCard.tsx": "Card displaying product image, price, category badge, and actions for adding to cart or ordering via WhatsApp.",
  "frontend/src/components/products/ProductGrid.tsx": "Responsive grid that renders a list of products using ProductCard components.",
  "frontend/src/hooks/admin/useAdminSession.ts": "Manages admin auth session using react-query, storing tokens in sessionStorage and providing login, logout, and session validation hooks.",
  "frontend/src/hooks/cart/useCart.ts": "Implements a cart state with sessionStorage persistence and actions for modifying items, quantities, totals, and clearing the cart.",
  "frontend/src/hooks/products/useProductMutations.ts": "Defines create, update, and delete product mutations requiring an admin token and invalidating product queries with success/error toasts.",
  "frontend/src/hooks/products/useProducts.ts": "Fetches all product summaries via react-query, using the actor when available.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refetching dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identity loading, and exposing identity state and actions.",
  "frontend/src/index.css": "Defines Tailwind base setup and custom CSS variables for light and dark theme color palettes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard for managing products, including listing, adding, and logging out.",
  "frontend/src/pages/admin/AdminLoginPage.tsx": "Admin login form handling authentication, error display, and redirect on success.",
  "frontend/src/pages/CartPage.tsx": "Renders the shopping cart UI with item controls, subtotal display, and navigation to checkout or product browser.",
  "frontend/src/pages/CheckoutPage.tsx": "Checkout form page that validates customer info, builds a WhatsApp order URL, submits the order, and clears the cart.",
  "frontend/src/pages/CustomerPanelPage.tsx": "Customer-facing product browsing page with category filtering and loading/error states.",
  "frontend/src/pages/ProductListingPage.tsx": "Displays all products grouped by category with loading and error handling.",
  "frontend/src/types/cart.ts": "Type definitions for cart items, cart state, and cart manipulation actions.",
  "frontend/src/utils/adminAuthErrors.ts": "Utility to classify and normalize admin auth errors and detect transient connectivity issues.",
  "frontend/src/utils/images.ts": "Image validation and compression utilities supporting type checks, size limits, and canvas-based resizing.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL parameters using query strings and sessionStorage.",
  "frontend/src/utils/whatsapp.ts": "Provides helper functions to generate WhatsApp order URLs for single products and full cart orders with encoded messages.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, typography, animations, container settings, and plugins for the frontend.",
  "project_state.json": "Stores the project’s current state, including requirements, architecture notes, known issues, and existing implemented features."
}