{
  "backend/main.mo": "Actor implementing blob storage, access control, user profiles, and admin‑restricted product CRUD operations.",
  "backend/migration.mo": "No-op migration module returning the previous actor state.",
  "feature_evidence.json": "Feature evidence report mapping feature requests to affected files, components, and tests.",
  "frontend-file-summaries.txt": "Prewritten summaries describing key frontend admin session, login, and product mutation files.",
  "frontend/index.css": "Tailwind CSS setup defining light and dark theme variables and base styles.",
  "frontend/index.html": "Basic HTML entry point that loads the React app.",
  "frontend/src/App.tsx": "Main React app configuring routes, theme, query client, and layout structure.",
  "frontend/src/components/admin/AdminRouteGuard.tsx": "Route guard that redirects unauthenticated admins and shows a loading spinner during checks.",
  "frontend/src/components/admin/ImagePicker.tsx": "Image upload component handling validation, compression, preview, and conversion to ExternalBlob.",
  "frontend/src/components/admin/ProductEditorDialog.tsx": "Dialog for creating and editing products with form fields, image picker, and mutation hooks.",
  "frontend/src/components/admin/ProductTable.tsx": "Admin table for listing, editing, and deleting products with dialogs and image fallbacks.",
  "frontend/src/components/branding/BrandingHero.tsx": "Hero section displaying brand logo, tagline, feature badges, and a large hero image.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer showing site branding and a credit link with a decorative heart icon.",
  "frontend/src/components/layout/SiteHeader.tsx": "Responsive header with navigation links, mobile menu toggle, and admin login button.",
  "frontend/src/components/layout/SiteLayout.tsx": "Page layout wrapper including header, footer, and main content area.",
  "frontend/src/components/products/CategorySection.tsx": "Renders a titled product section with grid or empty-state message.",
  "frontend/src/components/products/CategorySwitcher.tsx": "Tab-based category selector for filtering products by type.",
  "frontend/src/components/products/ProductCard.tsx": "Displays a product with image, price, category badge, and a WhatsApp order button.",
  "frontend/src/components/products/ProductGrid.tsx": "Responsive grid layout rendering multiple ProductCard components.",
  "frontend/src/hooks/admin/useAdminSession.ts": "Manages admin authentication state, login, and logout using URL session params and backend checks.",
  "frontend/src/hooks/products/useProductMutations.ts": "React Query mutations for creating, updating, and deleting products with admin validation and toasts.",
  "frontend/src/hooks/products/useProducts.ts": "Fetches all products from the backend using React Query when actor is available.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on authenticated identity and initializes access control.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication and states using Dfinity AuthClient.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light and dark theme color palettes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard for managing products, including add dialog, product table, and logout.",
  "frontend/src/pages/admin/AdminLoginPage.tsx": "Admin login form handling authentication, validation, and error display.",
  "frontend/src/pages/CustomerPanelPage.tsx": "Displays a customer-facing product menu with category filtering and loading/error states.",
  "frontend/src/pages/ProductListingPage.tsx": "Renders a full categorized product listing with loading and error handling.",
  "frontend/src/utils/images.ts": "Validates and compresses uploaded image files with size/type checks and canvas-based compression.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters using query strings and sessionStorage.",
  "frontend/src/utils/whatsapp.ts": "Builds a WhatsApp order URL containing product details.",
  "frontend/tailwind.config.js": "Tailwind CSS config enabling dark mode, custom colors, fonts, animations, container settings, and plugins like typography and container queries.",
  "project_state.json": "Project metadata describing a food ordering site, architectural notes, known issues, and a list of implemented features with IDs and versions."
}