{
  "kind": "build_request",
  "title": "Add English About Us page and homepage bottom RKS contact block",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-43",
      "text": "Create a new public \"About Us\" page in English that describes DailyKart as a local online ordering platform (not a direct seller), operating under RKS Brand, serving Vrindavan (nearby areas), and includes the provided Terms & Policy sections plus a Help Desk / Contact section.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-8",
          "msg-10"
        ],
        "quotes": [
          "ABOUT US SAI NEW PAGE  ADD  AND  BRAND   UR HOME PAGE NICHE   ADRESS UR BRAND NAME  RKS   UR CONTACT NO  BS  3 CHIZ add krne hai ur  text english  mai add krna hai not easy ok",
          "MUJE SITE DAILY CART ek local online ordering platform hai...",
          "📜 TERMS & POLICY (Basic) ... 🆘 HELP DESK / CONTACT US ..."
        ]
      },
      "acceptanceCriteria": [
        "A new route is available at \"/about\" and renders without requiring login.",
        "All user-facing text on the About Us page is in English.",
        "The About Us page includes these sections (with clear headings): Overview (DailyKart purpose), Service Area (Vrindavan + nearby areas), Terms & Policy (Order Policy, Payment Policy, Delivery Policy, Cancellation Policy, Responsibility), and Help Desk / Contact Us.",
        "The About Us page explicitly states that DailyKart is not the direct seller and that orders are forwarded to nearby shopkeepers; payments are made directly to the shopkeeper; delivery is handled by the shopkeeper.",
        "The Help Desk / Contact section includes: Mobile Number 9897743469, Owner Name Ram Kumar Saini, Brand Name RKS Brand, Address \"Vrindavan, Rukmani Vihar, Sector-2\"."
      ]
    },
    {
      "id": "REQ-44",
      "text": "Add navigation access to the new About Us page from the existing site header navigation (desktop and mobile) using the label \"About Us\".",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "yes okk"
        ]
      },
      "acceptanceCriteria": [
        "The site header shows an \"About Us\" link alongside existing navigation items.",
        "The \"About Us\" link works on both desktop and mobile menus and navigates to \"/about\".",
        "Adding this link does not remove or change existing navigation actions (Home, All Products, Cart, Admin)."
      ]
    },
    {
      "id": "REQ-45",
      "text": "Add a bottom section on the Home page (\"/\") that displays exactly these three items in English: Brand Name (RKS), Address (Vrindavan, Rukmani Vihar, Sector-2), and Contact Number (9897743469).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8",
          "msg-10"
        ],
        "quotes": [
          "BRAND   UR HOME PAGE NICHE   ADRESS UR BRAND NAME  RKS   UR CONTACT NO  BS  3 CHIZ add krne hai",
          "yes okk"
        ]
      },
      "acceptanceCriteria": [
        "On the Home page, a clearly visible bottom section appears below the main content and before the global footer ends.",
        "The section displays these fields in English with the exact values: Brand Name: RKS; Address: Vrindavan, Rukmani Vihar, Sector-2; Contact Number: 9897743469.",
        "The section is not shown on non-home routes (e.g., /products, /cart, /checkout, /admin/*, /about).",
        "This section follows the existing site styling system (Tailwind theme tokens) and is mobile-friendly (no horizontal overflow, readable on small screens)."
      ]
    }
  ],
  "constraints": [
    "Use English for all new user-facing text added by these changes.",
    "Do not edit files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or any files under frontend/src/components/ui (compose them instead).",
    "Keep backend architecture unchanged (single Motoko actor); no backend changes are required for this request."
  ],
  "nonGoals": [
    "Do not change existing WhatsApp ordering flows (single-product or cart checkout).",
    "Do not change admin authentication, admin routes, or product management behavior as part of this request.",
    "Do not introduce new categories, product fields, or backend storage changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}