{
  "kind": "build_request",
  "title": "Fix Admin Panel: Add Product button disappears after first product",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-28",
      "text": "Fix the Admin Dashboard UI so the admin can always access an \"Add Product\" action after creating the first product (i.e., the Add Product button must not disappear), allowing multiple products to be created in succession.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "mne ek product add kiya tha uske bad add ka button nahi shoew ho raha hai    nahi dekh raha hai button   yh problem admin pannel mai hai"
        ]
      },
      "acceptanceCriteria": [
        "After successfully creating a product, the Admin Dashboard still shows an \"Add Product\" action that can be used to open the create-product dialog again.",
        "An admin can create at least 3 different products in a row in a single session without needing to refresh the page.",
        "No user-facing text is introduced in a non-English language (keep UI text in English)."
      ]
    },
    {
      "id": "REQ-29",
      "text": "Improve the Admin Dashboard product management screen so the \"Add Product\" action is discoverable even when the product list is long (e.g., provide an additional in-context Add Product entry point near the product list and/or a persistent/sticky action on small screens), without removing the existing top action button.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "add ka button nahi shoew ho raha hai"
        ]
      },
      "acceptanceCriteria": [
        "When the product list is non-empty and the user scrolls down on mobile-sized screens, there remains an obvious way to add a new product without scrolling back to the very top.",
        "When there are zero products, the empty-state area includes a clickable \"Add Product\" action that opens the create-product dialog.",
        "The create-product dialog opens reliably from every \"Add Product\" entry point and closes on successful creation, ready to create another product."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be modified: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui (compose existing UI components instead).",
    "Keep all user-facing text in English."
  ],
  "nonGoals": [
    "Changing backend product CRUD behavior or data model.",
    "Adding new categories beyond the fixed Food and Grocery categories.",
    "Adding new authentication methods or changing admin credentials."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}