{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Admin Dashboard: Persistent and Discoverable Add Product Actions",
  "requirements": [
    {
      "id": "REQ-28",
      "summary": "Ensure the Admin Dashboard always provides an Add Product action after creating products, allowing multiple consecutive creations without refresh.",
      "acceptanceCriteria": [
        "After successfully creating a product, the Admin Dashboard still shows an \"Add Product\" action that can be used to open the create-product dialog again.",
        "An admin can create at least 3 different products in a row in a single session without needing to refresh the page.",
        "No user-facing text is introduced in a non-English language (keep UI text in English)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/admin/AdminDashboardPage.tsx",
          "operation": "modify",
          "description": "Refactor the create-product dialog open/close control into a stable handler (e.g., openCreate/closeCreate) and pass it down to child UI so Add Product can be triggered reliably after each successful create. Keep the existing top \"Add Product\" button always rendered. Use existing shadcn-ui Button for the action. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/admin/ProductEditorDialog.tsx",
          "operation": "modify",
          "description": "Harden the create flow so, after a successful creation, the dialog closes and the form state is reset/ready for the next creation when reopened (avoid any stale form values or stuck pending state). Keep all user-facing text in English. Use existing shadcn-ui Dialog and form controls; do not modify UI component source. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-29",
      "summary": "Add additional, in-context Add Product entry points for long product lists and improve the empty state so Add Product is discoverable without removing the existing top button.",
      "acceptanceCriteria": [
        "When the product list is non-empty and the user scrolls down on mobile-sized screens, there remains an obvious way to add a new product without scrolling back to the very top.",
        "When there are zero products, the empty-state area includes a clickable \"Add Product\" action that opens the create-product dialog.",
        "The create-product dialog opens reliably from every \"Add Product\" entry point and closes on successful creation, ready to create another product."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/ProductTable.tsx",
          "operation": "modify",
          "description": "Add a new prop (e.g., onAddProduct) to open the create-product dialog from within the product management area. Implement: (1) an empty-state \"Add Product\" button, and (2) an in-context add entry point near the list (e.g., a small toolbar button above the table/cards). Use existing shadcn-ui Button and existing layout primitives; keep all text in English. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/admin/AdminDashboardPage.tsx",
          "operation": "modify",
          "description": "Wire the new ProductTable onAddProduct prop to the same create dialog opener used by the top action button. Add a mobile-friendly persistent/sticky Add Product action (e.g., a fixed-position button on small screens) while retaining the existing top action button. Use existing shadcn-ui Button (and lucide Plus icon already in use). Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}